; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob54) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear crate0)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot0)
	(clear pallet6)
	(at pallet7 depot1)
	(clear crate3)
	(at pallet8 distributor2)
	(clear crate5)
	(at truck0 depot2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 478)
	(at truck1 depot1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 294)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor1)
	(available hoist10)
	(at crate0 depot2)
	(on crate0 pallet2)
	(= (weight crate0) 13)
	(at crate1 depot1)
	(on crate1 pallet1)
	(= (weight crate1) 60)
	(at crate2 distributor2)
	(on crate2 pallet8)
	(= (weight crate2) 14)
	(at crate3 depot1)
	(on crate3 pallet7)
	(= (weight crate3) 86)
	(at crate4 distributor2)
	(on crate4 crate2)
	(= (weight crate4) 3)
	(at crate5 distributor2)
	(on crate5 crate4)
	(= (weight crate5) 45)
	(at crate6 distributor0)
	(on crate6 pallet3)
	(= (weight crate6) 91)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 pallet6)
		(on crate3 pallet5)
		(on crate4 pallet1)
		(on crate5 pallet4)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 5
2. (load hoist1 crate1 truck1 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 60
   goals met: 0 of 5
3. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 5
4. (lift hoist2 crate0 pallet2 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 5
5. (load hoist2 crate0 truck0 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 13
   goals met: 0 of 5
6. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 5
7. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 60 to 0
   goals met: 0 of 5
8. (lift hoist9 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist9) (on crate6 pallet3)
   added: (lifting hoist9 crate6) (clear pallet3)
   changed: (fuel-cost) from 22 to 23
   goals met: 0 of 5
9. (drop hoist0 crate1 pallet6 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet6)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet6)
   goals met: 1 of 5
10. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck0) from 13 to 0
   goals met: 1 of 5
11. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 5
12. (drop hoist3 crate0 pallet3 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 2 of 5
13. (lift hoist1 crate3 pallet7 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet7)
   added: (lifting hoist1 crate3) (clear pallet7)
   changed: (fuel-cost) from 33 to 34
   goals met: 2 of 5
14. (load hoist1 crate3 truck0 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 86
   goals met: 2 of 5
15. (lift hoist5 crate5 crate4 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate4)
   added: (lifting hoist5 crate5) (clear crate4)
   changed: (fuel-cost) from 34 to 35
   goals met: 2 of 5
16. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 35 to 45
   goals met: 2 of 5
17. (load hoist5 crate5 truck0 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck0) (available hoist5)
   changed: (current_load truck0) from 86 to 131
   goals met: 2 of 5
18. (unload hoist5 crate3 truck0 distributor2)
   deleted: (in crate3 truck0) (available hoist5)
   added: (lifting hoist5 crate3)
   changed: (current_load truck0) from 131 to 45
   goals met: 2 of 5
19. (drop hoist5 crate3 pallet5 distributor2)
   deleted: (lifting hoist5 crate3) (clear pallet5)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 pallet5)
   goals met: 3 of 5
20. (lift hoist5 crate4 crate2 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 crate2)
   added: (lifting hoist5 crate4) (clear crate2)
   changed: (fuel-cost) from 45 to 46
   goals met: 3 of 5
21. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   changed: (current_load truck0) from 45 to 48
   goals met: 3 of 5
22. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 46 to 56
   goals met: 3 of 5
23. (unload hoist1 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 48 to 45
   goals met: 3 of 5
24. (drop hoist1 crate4 pallet1 depot1)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 pallet1)
   goals met: 4 of 5
25. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 56 to 66
   goals met: 4 of 5
26. (unload hoist10 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist10)
   added: (lifting hoist10 crate5)
   changed: (current_load truck0) from 45 to 0
   goals met: 4 of 5
27. (drop hoist10 crate5 pallet4 distributor1)
   deleted: (lifting hoist10 crate5) (clear pallet4)
   added: (available hoist10) (at crate5 distributor1) (clear crate5) (on crate5 pallet4)
   goals met: 5 of 5
